stm32-hotspot/STM32WBA-p2p-Client-FreeRTOS/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_p2pClientFreeRTOS/STM32_WPAN/App/app_ble.c
            bleAppContext.deviceServerFound = 0x01;
            
            APP_DBG_MSG("  P2P server, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                            bleAppContext.a_deviceServerBdAddr[5],
                            bleAppContext.a_deviceServerBdAddr[4],
                            bleAppContext.a_deviceServerBdAddr[3],
                            bleAppContext.a_deviceServerBdAddr[2],
                            bleAppContext.a_deviceServerBdAddr[1],
                            bleAppContext.a_deviceServerBdAddr[0]);
            found_status = 1;
          }
          break;
        }
        default:
          break;
        }/* end of switch*/

      i += ad_length + 1; /* increment the iterator to go on next element*/
      /*
      if (found_status != 0)
      {
        break;
      }
      */
    }/* end of while*/
  }

  return found_status;
}

static void Connect_Request(void)
{
  tBleStatus result;

  if (bleAppContext.deviceServerFound != 0)
  {
    APP_DBG_MSG("Create connection to P2Pserver\n");

    result = aci_gap_create_connection(SCAN_INT_MS(500u), SCAN_WIN_MS(500u),
                                       GAP_PUBLIC_ADDR,
                                       &bleAppContext.a_deviceServerBdAddr[0],
                                       GAP_PUBLIC_ADDR,
                                       CONN_INT_MS(50u), CONN_INT_MS(100u),
                                       0u,
                                       CONN_SUP_TIMEOUT_MS(5000u),
                                       CONN_CE_LENGTH_MS(10u), CONN_CE_LENGTH_MS(10u));
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
      APP_DBG_MSG("  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
      osSemaphoreAcquire(CONNECTION_REQ_Thread_Sem, osWaitForever);
      if(new_ConnHdl != 0u)
      {
        GATT_CLIENT_APP_Set_Conn_Handle(0, new_ConnHdl);
        new_ConnHdl = 0u;

        APP_DBG_MSG("Discover services, characteristics and descriptors for P2Pserver\n");
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, GPIO_PIN_RESET); 
      }
    }
    else
    {
      APP_DBG_MSG("==>> GAP Create connection Failed , result: 0x%02x\n", result);
    }
  }

  return;
}
/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

uint8_t BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  BleEvtPacket_t *phcievt;
  uint16_t total_length = (length+ext_length);
  /* Unused parameter */
  (void)ext_data;

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    if (AMM_Alloc (CFG_AMM_VIRTUAL_APP_BLE,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   NULL) != AMM_ERROR_OK)
    {
      APP_DBG_MSG("Memory pool Empty\n");
      Error_Handler();
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      memcpy( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      /* FREERTOS_MARK */
      osSemaphoreRelease(HCI_ASYNCH_EVT_Thread_Sem);
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
  }
  return 0u;
}
/* FREERTOS_MARK */
void BleStack_Process_BG_Entry(void* thread_input)
{
  (void)(thread_input);
  
  while(1)
  {
    osSemaphoreAcquire(BLE_HOST_Thread_Sem, osWaitForever);
    BleStack_Process_BG();
  }
}

void Ble_UserEvtRx_Entry(void* thread_input)
{
  (void)(thread_input);

  while(1)
  {
    osSemaphoreAcquire(HCI_ASYNCH_EVT_Thread_Sem, osWaitForever);
    /* FREERTOS_MARK */
    osMutexAcquire(LINK_LAYER_Thread_Mutex, osWaitForever);
    Ble_UserEvtRx();
    /* FREERTOS_MARK */
    osMutexRelease(LINK_LAYER_Thread_Mutex);
  }
}
static void connection_request_entry(void* thread_input)
{
  (void)(thread_input);

  while(1)
  {
    osThreadFlagsWait( 1, osFlagsWaitAny, osWaitForever);
    /* FREERTOS_MARK */
    Connect_Request();
  }
}

void NVMCB_Store( const uint32_t* ptr, uint32_t size )
{
  (void)ptr;
  (void)size;

  /* Call SNVMA for storing - Without callback */
  SNVMA_Write (APP_BLE_NvmBuffer,
               BLE_NvmCallback);
}
/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
